Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.SetMessageExecutionStatus Method
Note: This API is now obsolete.
 Sets the message execution mode for the application.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("SetMessageExecutionStatus is obsolete and ignored. Message  is ignored. MessageExecutionStatus always defaults to BY_COMMIT.",
	false)]
public static DrawingHandler.MessageExecutionModeEnum SetMessageExecutionStatus(
	DrawingHandler.MessageExecutionModeEnum mode
)
<ObsoleteAttribute("SetMessageExecutionStatus is obsolete and ignored. Message  is ignored. MessageExecutionStatus always defaults to BY_COMMIT.",
	false)>
Public Shared Function SetMessageExecutionStatus (
	mode As DrawingHandler.MessageExecutionModeEnum
) As DrawingHandler.MessageExecutionModeEnum
Parameters
mode
Type: Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum
The new mode.
Return Value
Type: DrawingHandler.MessageExecutionModeEnum
The old message execution mode.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum